target/classes/sample-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                 xmlns:ns2="http://10.61.40.133/shep/bip-sync-wss-gost/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns2:ContractSyncRequest>
            <ns2:RequestInfo>
                <ns2:RequestId>REQ123456789</ns2:RequestId>
                <ns2:Timestamp>2025-05-30T12:30:00</ns2:Timestamp>
                <ns2:SourceSystem>ESUTD</ns2:SourceSystem>
            </ns2:RequestInfo>
            <ns2:ContractData>
                <ns2:Operation>CREATE_CONTRACT</ns2:Operation>
                <ns2:Contract>
                    <ns2:ContractId>CTR-2025-001</ns2:ContractId>
                    <ns2:ContractNumber>K-2025/123</ns2:ContractNumber>
                    <ns2:ContractDate>2025-05-30</ns2:ContractDate>
                    <ns2:ContractDurationType>FIXED_TERM</ns2:ContractDurationType>
                    <ns2:StartDate>2025-06-01</ns2:StartDate>
                    <ns2:EndDate>2026-05-31</ns2:EndDate>
                    <ns2:ContractType>FIXED_TERM_ONE_YEAR_PLUS</ns2:ContractType>
                    <ns2:Position>Системный аналитик</ns2:Position>
                    <ns2:PositionCode>2511-1-002</ns2:PositionCode>
                    <ns2:WorkType>FULL_TIME</ns2:WorkType>
                    <ns2:RemoteWork>true</ns2:RemoteWork>
                    <ns2:WorkPlaceAddress>г. Астана, ул. Мангилик Ел 55/5</ns2:WorkPlaceAddress>
                    <ns2:WorkPlaceKato>711000000</ns2:WorkPlaceKato>
                    <ns2:WorkPlaceCountry>KZ</ns2:WorkPlaceCountry>
                    <ns2:WorkHours>1</ns2:WorkHours>
                    <ns2:TariffRate>500000</ns2:TariffRate>
                    <ns2:WorkConditionCode>STANDARD</ns2:WorkConditionCode>
                    <ns2:Department>Департамент информационных технологий</ns2:Department>
                    <ns2:GeneralSkills>Java, Spring Boot, SQL</ns2:GeneralSkills>
                    <ns2:ProfessionalSkills>Разработка микросервисов, REST API</ns2:ProfessionalSkills>
                </ns2:Contract>
                <ns2:Employee>
                    <ns2:EmployeeId>EMP-2025-001</ns2:EmployeeId>
                    <ns2:IIN>901231123456</ns2:IIN>
                    <ns2:LastName>Русланов</ns2:LastName>
                    <ns2:FirstName>Руслан</ns2:FirstName>
                    <ns2:MiddleName>Русланович</ns2:MiddleName>
                    <ns2:BirthDate>1990-12-31</ns2:BirthDate>
                    <ns2:Gender>MALE</ns2:Gender>
                    <ns2:Citizenship>KZ</ns2:Citizenship>
                    <ns2:Address>
                        <ns2:CountryCode>KZ</ns2:CountryCode>
                        <ns2:KATOCode>711210</ns2:KATOCode>
                        <ns2:City>Астана</ns2:City>
                        <ns2:Street>Абая</ns2:Street>
                        <ns2:Building>12</ns2:Building>
                        <ns2:Apartment>45</ns2:Apartment>
                        <ns2:PostalCode>010000</ns2:PostalCode>
                    </ns2:Address>
                    <ns2:BankName>Народный Банк</ns2:BankName>
                    <ns2:BIK>HSBKKZKX</ns2:BIK>
                    <ns2:AccountNumber>KZ123456789012345678</ns2:AccountNumber>
                    <ns2:PhoneNumber>+77771234567</ns2:PhoneNumber>
                    <ns2:HRPhoneNumber>+77776543210</ns2:HRPhoneNumber>
                </ns2:Employee>
                <ns2:Employer>
                    <ns2:EmployerId>EMPL-2025-001</ns2:EmployerId>
                    <ns2:BIN>123456789012</ns2:BIN>
                    <ns2:Name>ТОО "ТехноСофт"</ns2:Name>
                    <ns2:KatoCode>711000000</ns2:KatoCode>
                    <ns2:EmployerType>TOO</ns2:EmployerType>
                    <ns2:LegalAddress>
                        <ns2:CountryCode>KZ</ns2:CountryCode>
                        <ns2:KATOCode>711000000</ns2:KATOCode>
                        <ns2:City>Астана</ns2:City>
                        <ns2:Street>Мангилик Ел</ns2:Street>
                        <ns2:Building>55/5</ns2:Building>
                        <ns2:PostalCode>010000</ns2:PostalCode>
                    </ns2:LegalAddress>
                    <ns2:Contacts>
                        <ns2:Phone>+77272123456</ns2:Phone>
                        <ns2:Email>info@technosoft.kz</ns2:Email>
                    </ns2:Contacts>
                    <ns2:BankName>Народный Банк</ns2:BankName>
                    <ns2:BIK>HSBKKZKX</ns2:BIK>
                    <ns2:AccountNumber>KZ987654321098765432</ns2:AccountNumber>
                </ns2:Employer>
            </ns2:ContractData>
        </ns2:ContractSyncRequest>
    </soapenv:Body>
</soapenv:Envelope>